def exibir(consumo, otimizado, pico, anomalia):
    print(r"""
    ███████╗███╗   ██╗███████╗██████╗ ██╗   ██╗██╗███████╗██╗ ██████╗ ███╗   ██╗
    ██╔════╝████╗  ██║██╔════╝██╔══██╗██║   ██║██║██╔════╝██║██╔═══██╗████╗  ██║
    █████╗  ██╔██╗ ██║█████╗  ██████╔╝██║   ██║██║███████╗██║██║   ██║██╔██╗ ██║
    ██╔══╝  ██║╚██╗██║██╔══╝  ██╔══██╗╚██╗ ██╔╝██║╚════██║██║██║   ██║██║╚██╗██║
    ███████╗██║ ╚████║███████╗██║  ██║ ╚████╔╝ ██║███████║██║╚██████╔╝██║ ╚████║
    ╚══════╝╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝  ╚═══╝  ╚═╝╚══════╝╚═╝ ╚═════╝ ╚═╝  ╚═══╝
              Sistema de Monitoramento Energético
    """)
    print(f"\nConsumo atual: {round(consumo, 2)} W")
    print(f"Consumo otimizado: {round(otimizado, 2)} W")
    if pico:
        print("\n⚠️ =Pico de demanda detectado= ⚠️\n")
    if anomalia:
        print("\n🔧 =Anomalia detectada! Manutenção preventiva recomendada= 🔧\n")
    print("==============================================================================")